; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 862936 2 1 3 6 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image2 - mode
	image1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	Star3 - direction
	Star2 - direction
	GroundStation0 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(have_image Star6 spectrograph0)
	(have_image Planet7 image1)
	(have_image Planet8 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (turn_to satellite1 star6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star6)
   goals met: 0 of 4
4. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   goals met: 0 of 4
5. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 4
6. (turn_to satellite1 groundstation0 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 4
7. (turn_to satellite0 planet7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet7)
   goals met: 0 of 4
8. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 4
9. (take_image satellite0 planet7 instrument0 image1)
   added: (have_image planet7 image1)
   goals met: 1 of 4
10. (turn_to satellite1 star6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star6)
   goals met: 1 of 4
11. (take_image satellite1 star6 instrument1 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 2 of 4
12. (turn_to satellite1 planet8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet8)
   goals met: 2 of 4
13. (take_image satellite1 planet8 instrument1 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 3 of 4
14. (turn_to satellite1 groundstation1 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation1)
   goals met: 4 of 4
